app/controllers/songs_controller.rb

SELECT  "songs".* FROM "songs"  ORDER BY "songs"."created_at" DESC LIMIT 20 OFFSET 0
---
  def index
    @songs = Song.order(created_at: :desc).page(params[:page])